DeveloperMarcial/Arduino_Public/src/Esp32RomFlasher.cpp
#include "Esp32RomFlasher.h"

#include <algorithm>
#include <cstdio>
#include <cstring>

#include "AppConfig.h"

namespace {

constexpr uint8_t kSlipEnd = 0xC0;
constexpr uint8_t kSlipEsc = 0xDB;
constexpr uint8_t kSlipEscEnd = 0xDC;
constexpr uint8_t kSlipEscEsc = 0xDD;

constexpr uint8_t kPacketRequest = 0x00;
constexpr uint8_t kPacketResponse = 0x01;

constexpr uint8_t kCommandFlashBegin = 0x02;
constexpr uint8_t kCommandFlashData = 0x03;
constexpr uint8_t kCommandFlashEnd = 0x04;
constexpr uint8_t kCommandMemBegin = 0x05;
constexpr uint8_t kCommandMemEnd = 0x06;
constexpr uint8_t kCommandMemData = 0x07;
constexpr uint8_t kCommandSync = 0x08;
constexpr uint8_t kCommandSpiSetParams = 0x0B;
constexpr uint8_t kCommandSpiAttach = 0x0D;
constexpr uint8_t kCommandChangeBaud = 0x0F;
constexpr uint8_t kCommandSpiFlashMd5 = 0x13;
constexpr uint8_t kCommandEraseFlash = 0xD0;

constexpr uint32_t kFlashBlockSize = 1024;
constexpr uint32_t kStubBlockSize = 1024;
constexpr uint32_t kFlashSectorSize = 4096;
constexpr uint32_t kFlashPageSize = 256;
constexpr uint32_t kDefaultFlashSize = 4U * 1024U * 1024U;
constexpr uint32_t kDefaultFlashBlockEraseSize = 64U * 1024U;
constexpr uint32_t kDefaultStatusMask = 0xFFFFU;
constexpr uint32_t kChecksumMagic = 0xEFU;
constexpr uint32_t kResponseTimeoutMs = 3000;
constexpr uint32_t kSyncTimeoutMs = 2000;
constexpr uint32_t kFlashEndTimeoutMs = 250;
constexpr uint8_t kSyncAttemptCount = 20;
constexpr uint8_t kSyncAttemptsPerBootEntry = 5;
constexpr uint32_t kStubReadyTimeoutMs = 3000;
constexpr uint32_t kEraseTimeoutMs = 120000;
constexpr uint32_t kMd5TimeoutPerMbMs = 8000;
constexpr uint32_t kMinimumMd5TimeoutMs = 3000;
constexpr uint32_t kEraseRegionTimeoutPerMbMs = 30000;
constexpr uint32_t kMinimumFlashBeginTimeoutMs = 3000;
constexpr uint32_t kTemporaryRawBootReadMs = 2000;
constexpr size_t kCommandHeaderSize = 8;
constexpr size_t kFlashDataHeaderSize = 16;
constexpr char kStubReadyMessage[] = "OHAI";
constexpr size_t kMd5HexLength = 32;
constexpr uint8_t kCommandResponseRetryCount = 8;

void bytesToHex(const uint8_t *input, size_t length, char *output, size_t outputCapacity) {
  static constexpr char kHexChars[] = "0123456789abcdef";
  if (outputCapacity < (length * 2U + 1U)) {
    if (outputCapacity > 0U) {
      output[0] = '\0';
    }
    return;
  }

  for (size_t i = 0; i < length; ++i) {
    output[i * 2U] = kHexChars[(input[i] >> 4) & 0x0FU];
    output[i * 2U + 1U] = kHexChars[input[i] & 0x0FU];
  }
  output[length * 2U] = '\0';
}

void writeLe16(uint8_t *destination, uint16_t value) {
  destination[0] = static_cast<uint8_t>(value & 0xFFU);
  destination[1] = static_cast<uint8_t>((value >> 8) & 0xFFU);
}

void writeLe32(uint8_t *destination, uint32_t value) {
  destination[0] = static_cast<uint8_t>(value & 0xFFU);
  destination[1] = static_cast<uint8_t>((value >> 8) & 0xFFU);
  destination[2] = static_cast<uint8_t>((value >> 16) & 0xFFU);
  destination[3] = static_cast<uint8_t>((value >> 24) & 0xFFU);
}

uint16_t readLe16(const uint8_t *source) {
  return static_cast<uint16_t>(source[0]) |
         (static_cast<uint16_t>(source[1]) << 8);
}

uint32_t readLe32(const uint8_t *source) {
  return static_cast<uint32_t>(source[0]) |
         (static_cast<uint32_t>(source[1]) << 8) |
         (static_cast<uint32_t>(source[2]) << 16) |
         (static_cast<uint32_t>(source[3]) << 24);
}

}  // namespace

bool Esp32RomFlasher::begin() {
  pinMode(AppConfig::kEsp32EnablePin, OUTPUT);
  pinMode(AppConfig::kEsp32BootPin, OUTPUT);

  digitalWrite(AppConfig::kEsp32EnablePin, HIGH);
  digitalWrite(AppConfig::kEsp32BootPin, HIGH);

  AppConfig::espSerial().begin(AppConfig::kInitialSyncBaud);
  return true;
}

bool Esp32RomFlasher::flash(FlashManifest &manifest, const StagingStore &store, SessionStatus &status)
{
  enterBootloader();

  Serial.println("Temporary raw ESP UART bytes after bootloader reset:");
  const uint32_t rawReadDeadline = millis() + kTemporaryRawBootReadMs;
  size_t rawByteCount = 0;
  while (millis() < rawReadDeadline) {
    while (AppConfig::espSerial().available() > 0) {
      const int value = AppConfig::espSerial().read();
      if (value < 0) {
        break;
      }

      if (rawByteCount > 0U) {
        Serial.print(' ');
      }
      Serial.print("0x");
      if (value < 0x10) {
        Serial.print('0');
      }
      Serial.print(value, HEX);
      ++rawByteCount;
    }
    delay(1);
  }
  if (rawByteCount == 0U) {
    Serial.print("<none>");
  }
  Serial.println();

  if (!syncBootloader(status)) {
    rebootNormal();
    return false;
  }

  if (!ensureEraseSupport(manifest, store, status)) {
    rebootNormal();
    return false;
  }

  if (!configureFlash(manifest, status)) {
    rebootNormal();
    return false;
  }

  if ((manifest.baud != 0U) && (manifest.baud != AppConfig::kInitialSyncBaud)) {
    if (!changeBaudRate(manifest.baud, status)) {
      rebootNormal();
      return false;
    }
  }

  size_t flashImageCount = 0;
  for (size_t i = 0; i < manifest.imageCount; ++i) {
    if (manifest.images[i].flashImage) {
      ++flashImageCount;
    }
  }

  size_t flashedImages = 0;
  for (size_t i = 0; i < manifest.imageCount; ++i) {
    if (!manifest.images[i].flashImage) {
      continue;
    }

    ImageSlot &image = manifest.images[i];
    if (!writeImage(image, store, status, flashedImages, flashImageCount)) {
      rebootNormal();
      return false;
    }

    if (!verifyFlashImage(image, store, status, flashedImages, flashImageCount)) {
      rebootNormal();
      return false;
    }
    ++flashedImages;
  }

  uint8_t endPayload[4] = {};
  writeLe32(endPayload, 1U);
  CommandResponse response;
  if (!sendCommand(kCommandFlashEnd, endPayload, sizeof(endPayload), 0U, response, kFlashEndTimeoutMs)) {
    Serial.println("ESP ROM FLASH_END produced no usable reply; continuing with hardware reboot");
    logCommandResponse("ESP ROM FLASH_END response:", response);
  }

  setStatus(status, "Flash complete, rebooting target", 100);
  rebootNormal();
  return true;
}

