DeveloperMarcial/Arduino_Public/src/Esp32RomFlasher.cpp
void Esp32RomFlasher::enterBootloader() {
  AppConfig::espSerial().flush();
  flushInput();

  Serial.println("Entering ESP ROM bootloader: BOOT low, pulsing EN");
  digitalWrite(AppConfig::kEsp32BootPin, LOW);
  delay(AppConfig::kBootHoldMs);

  digitalWrite(AppConfig::kEsp32EnablePin, LOW);
  delay(AppConfig::kResetPulseMs);
  digitalWrite(AppConfig::kEsp32EnablePin, HIGH);
}

void Esp32RomFlasher::rebootNormal() {
  Serial.println("Rebooting ESP target normally");
  digitalWrite(AppConfig::kEsp32BootPin, HIGH);
  delay(AppConfig::kBootHoldMs);
  digitalWrite(AppConfig::kEsp32EnablePin, LOW);
  delay(AppConfig::kResetPulseMs);
  digitalWrite(AppConfig::kEsp32EnablePin, HIGH);
}

void Esp32RomFlasher::flushInput() {
  while (AppConfig::espSerial().available() > 0) {
    AppConfig::espSerial().read();
  }
}

bool Esp32RomFlasher::sendSyncCommand(uint32_t argTimeoutMs) {
  // ESP ROM command 0x08 is SYNC. The ROM loader expects a 36-byte payload:
  // four fixed marker bytes followed by 32 bytes of 0x55. 
  // This is the same sync pattern used by esptool.py.
  //
  // The leading bytes are a recognizable command preamble. The trailing 0x55
  // bytes produce a clean alternating bit pattern on the UART line
  // (01010101), which gives the ROM loader plenty of edges while it is trying
  // to lock onto the host and respond with a valid SLIP-framed packet.
  uint8_t syncPayload[36] = {0x07, 0x07, 0x12, 0x20};
  memset(syncPayload + 4, 0x55, sizeof(syncPayload) - 4);

  // SYNC has no checksum payload in the ESP ROM protocol, so the checksum
  // field is zero. Any valid response to this command means the target is in
  // the UART ROM bootloader and the Portenta UART path is working.
  CommandResponse response;
  //            0x08 SYNC command,     payload,                      checksum, response buffer, timeout
  const bool ok = sendCommand(kCommandSync, syncPayload, sizeof(syncPayload),       0U,        response, argTimeoutMs);

  Serial.print("ESP ROM SYNC response: ok=");
  Serial.print(ok ? "true" : "false");
  Serial.print(" direction=0x");
  Serial.print(response.direction, HEX);
  Serial.print(" command=0x");
  Serial.print(response.command, HEX);
  Serial.print(" size=");
  Serial.print(response.size);
  Serial.print(" value=0x");
  Serial.print(response.value, HEX);
  Serial.print(" status_length=");
  Serial.print(response.statusLength);
  if (response.statusLength >= 2U) {
    Serial.print(" status=[0x");
    Serial.print(response.status[0], HEX);
    Serial.print(",0x");
    Serial.print(response.status[1], HEX);
    Serial.print("]");
  }
  Serial.print(" data_length=");
  Serial.println(response.dataLength);

  return ok;
}

void Esp32RomFlasher::logCommandResponse(const char *prefix, const CommandResponse &response) {
  Serial.print(prefix);
  Serial.print(" ok=");
  const bool statusOk =
      (response.statusLength == 0U) ||
      ((response.status[0] == 0U) && (response.status[1] == 0U));
  Serial.print(statusOk ? "true" : "false");
  Serial.print(" direction=0x");
  Serial.print(response.direction, HEX);
  Serial.print(" command=0x");
  Serial.print(response.command, HEX);
  Serial.print(" size=");
  Serial.print(response.size);
  Serial.print(" value=0x");
  Serial.print(response.value, HEX);
  Serial.print(" status_length=");
  Serial.print(response.statusLength);
  if (response.statusLength >= 2U) {
    Serial.print(" status=[0x");
    Serial.print(response.status[0], HEX);
    Serial.print(",0x");
    Serial.print(response.status[1], HEX);
    Serial.print("]");
  }
  Serial.print(" data_length=");
  Serial.println(response.dataLength);
}

bool Esp32RomFlasher::syncBootloader(SessionStatus &status) {
  setStatus(status, "Synchronizing with ESP ROM bootloader", 5);
  const uint32_t settleAfterBootEntryMs = AppConfig::kBootloaderSettleMs;

  // Start each ROM sync phase from the known ESP ROM UART baud rate.
  AppConfig::espSerial().end();
  AppConfig::espSerial().begin(AppConfig::kInitialSyncBaud);
  delay(settleAfterBootEntryMs);
  flushInput();

  for (uint8_t attempt = 0; attempt < kSyncAttemptCount; ++attempt) {
    // Re-strap and reset the target periodically in case the previous attempt caught normal app boot.
    if ((attempt > 0U) && ((attempt % kSyncAttemptsPerBootEntry) == 0U)) {
      enterBootloader();
      delay(settleAfterBootEntryMs);
      flushInput();
    }

    // The ESP ROM sync command is safe to repeat; any valid response means the ROM loader is alive.
    char detail[96] = {};
    snprintf(detail, sizeof(detail), "Synchronizing with ESP ROM bootloader, attempt %u/%u",
             static_cast<unsigned>(attempt + 1U),
             static_cast<unsigned>(kSyncAttemptCount));
    setStatus(status, detail, 5);
    Serial.println(detail);

    if (sendSyncCommand(kSyncTimeoutMs)) {
      // The ESP ROM typically emits several additional SYNC replies after the
      // first successful handshake. Drain them now so the next command doesn't
      // accidentally read a leftover 0x08 response and report a false failure.
      CommandResponse extraSyncResponse;
      while (readCommandFrame(kCommandSync, extraSyncResponse, 50U, true)) {
        logCommandResponse("Discarding extra ESP ROM SYNC response:", extraSyncResponse);
      }

      setStatus(status, "ESP ROM bootloader synchronized", 10);
      Serial.println("ESP ROM bootloader synchronized");
      return true;
    }
    delay(200);
    flushInput();
  }

  // No ROM response means the target is not in UART ROM bootloader mode or the UART path is wrong.
  setStatus(status, "ESP ROM sync failed; check GND, UART TX/RX crossover, EN, GPIO0/BOOT wiring", 0);
  return false;
}

bool Esp32RomFlasher::configureFlash(const FlashManifest &manifest, SessionStatus &status) {
  setStatus(status, "Configuring ESP flash interface", 12);

  uint8_t attachPayload[8] = {};
  CommandResponse response;
  if (!sendCommand(kCommandSpiAttach, attachPayload, sizeof(attachPayload), 0U, response, kResponseTimeoutMs)) {
    logCommandResponse("ESP ROM SPI_ATTACH response:", response);
    setStatus(status, "SPI attach failed", 0);
    return false;
  }

  uint8_t paramsPayload[24] = {};
  const uint32_t flashSize = manifest.flashSize == 0U ? kDefaultFlashSize : manifest.flashSize;
  writeLe32(&paramsPayload[0], 0U);
  writeLe32(&paramsPayload[4], flashSize);
  writeLe32(&paramsPayload[8], kDefaultFlashBlockEraseSize);
  writeLe32(&paramsPayload[12], kFlashSectorSize);
  writeLe32(&paramsPayload[16], kFlashPageSize);
  writeLe32(&paramsPayload[20], kDefaultStatusMask);
  if (!sendCommand(kCommandSpiSetParams, paramsPayload, sizeof(paramsPayload), 0U, response, kResponseTimeoutMs)) {
    logCommandResponse("ESP ROM SPI_SET_PARAMS response:", response);
    setStatus(status, "SPI flash parameter setup failed", 0);
    return false;
  }

