DeveloperMarcial/Arduino_Public/src/Esp32RomFlasher.cpp
  return true;
}

bool Esp32RomFlasher::changeBaudRate(uint32_t baudRate, SessionStatus &status) {
  setStatus(status, "Switching ESP bootloader baud rate", 15);

  uint8_t payload[8] = {};
  writeLe32(&payload[0], baudRate);
  writeLe32(&payload[4], AppConfig::kInitialSyncBaud);

  CommandResponse response;
  if (!sendCommand(kCommandChangeBaud, payload, sizeof(payload), 0U, response, kResponseTimeoutMs)) {
    setStatus(status, "ESP bootloader baud-rate change failed", 0);
    return false;
  }

  AppConfig::espSerial().flush();
  AppConfig::espSerial().end();
  delay(50);
  AppConfig::espSerial().begin(baudRate);
  flushInput();

  for (uint8_t attempt = 0; attempt < 3; ++attempt) {
    uint8_t attachPayload[8] = {};
    CommandResponse probeResponse;
    if (sendCommand(kCommandSpiAttach, attachPayload, sizeof(attachPayload), 0U, probeResponse, kResponseTimeoutMs)) {
      return true;
    }
    delay(25);
    flushInput();
  }

  setStatus(status, "ESP stopped responding after baud-rate change", 0);
  return false;
}

bool Esp32RomFlasher::ensureEraseSupport(const FlashManifest &manifest, const StagingStore &store, SessionStatus &status) {
  if (!manifest.eraseFirst) {
    return true;
  }

  if (!manifest.stub.enabled) {
    setStatus(status, "Full chip erase requested, but no stub loader metadata was provided", 0);
    return false;
  }

  if (!startStub(manifest, store, status)) {
    return false;
  }

  return eraseFlashWithStub(status);
}

bool Esp32RomFlasher::startStub(const FlashManifest &manifest, const StagingStore &store, SessionStatus &status) {
  if ((manifest.stub.textImageName[0] == '\0') || (manifest.stub.dataImageName[0] == '\0') || (manifest.stub.entry == 0U)) {
    setStatus(status, "Stub metadata is incomplete", 0);
    return false;
  }

  if (!uploadStubSegment("stub text",
                         manifest.stub.textImageName,
                         manifest.stub.textStart,
                         manifest.stub.textSize,
                         store,
                         status)) {
    return false;
  }

  if (!uploadStubSegment("stub data",
                         manifest.stub.dataImageName,
                         manifest.stub.dataStart,
                         manifest.stub.dataSize,
                         store,
                         status)) {
    return false;
  }

  uint8_t endPayload[8] = {};
  writeLe32(&endPayload[0], 0U);
  writeLe32(&endPayload[4], manifest.stub.entry);

  uint8_t header[kCommandHeaderSize] = {};
  header[0] = kPacketRequest;
  header[1] = kCommandMemEnd;
  writeLe16(&header[2], sizeof(endPayload));
  writeLe32(&header[4], 0U);

  AppConfig::espSerial().write(kSlipEnd);
  for (size_t i = 0; i < sizeof(header); ++i) {
    writeSlipEscaped(header[i]);
  }
  for (size_t i = 0; i < sizeof(endPayload); ++i) {
    writeSlipEscaped(endPayload[i]);
  }
  AppConfig::espSerial().write(kSlipEnd);
  AppConfig::espSerial().flush();

  return waitForStubReady(status);
}

bool Esp32RomFlasher::uploadStubSegment(const char *label,
                                        const char *imageName,
                                        uint32_t loadAddress,
                                        uint32_t segmentSize,
                                        const StagingStore &store,
                                        SessionStatus &status) {
  const uint32_t storedSize = static_cast<uint32_t>(store.imageSize(imageName));
  if ((segmentSize == 0U) || (storedSize != segmentSize)) {
    setStatus(status, "Stub image size mismatch", 0);
    return false;
  }

  const uint32_t blockCount = alignedSize(segmentSize, kStubBlockSize) / kStubBlockSize;
  uint8_t beginPayload[16] = {};
  writeLe32(&beginPayload[0], segmentSize);
  writeLe32(&beginPayload[4], blockCount);
  writeLe32(&beginPayload[8], kStubBlockSize);
  writeLe32(&beginPayload[12], loadAddress);

  CommandResponse response;
  char detail[96] = {};
  snprintf(detail, sizeof(detail), "Loading %s into ESP RAM", label);
  setStatus(status, detail, 12);
  if (!sendCommand(kCommandMemBegin, beginPayload, sizeof(beginPayload), 0U, response, kResponseTimeoutMs)) {
    setStatus(status, "ESP MEM_BEGIN failed", 0);
    return false;
  }

  uint8_t block[kFlashDataHeaderSize + kStubBlockSize] = {};
  for (uint32_t blockIndex = 0; blockIndex < blockCount; ++blockIndex) {
    memset(block, 0, sizeof(block));

    const size_t sourceOffset = static_cast<size_t>(blockIndex) * kStubBlockSize;
    if (sourceOffset < segmentSize) {
      size_t bytesRead = 0;
      const size_t requestLength = std::min<size_t>(kStubBlockSize, static_cast<size_t>(segmentSize) - sourceOffset);
      if (!store.readImageChunk(imageName, sourceOffset, &block[kFlashDataHeaderSize], requestLength, bytesRead) ||
          (bytesRead != requestLength)) {
        setStatus(status, "Failed to read staged stub image", 0);
        return false;
      }
    }

    writeLe32(&block[0], kStubBlockSize);
    writeLe32(&block[4], blockIndex);
    writeLe32(&block[8], 0U);
    writeLe32(&block[12], 0U);

    if (!sendCommand(kCommandMemData,
                     block,
                     sizeof(block),
                     checksum(&block[kFlashDataHeaderSize], kStubBlockSize),
                     response,
                     kResponseTimeoutMs)) {
      setStatus(status, "ESP MEM_DATA failed", 0);
      return false;
    }
  }

  return true;
}

bool Esp32RomFlasher::waitForStubReady(SessionStatus &status) {
  setStatus(status, "Starting ESP flasher stub", 18);

  uint8_t frame[64] = {};
  size_t frameLength = 0;
  const uint32_t deadline = millis() + kStubReadyTimeoutMs;

  while (millis() < deadline) {
    const uint32_t remaining = deadline - millis();
    if (!readFrame(frame, sizeof(frame), frameLength, remaining)) {
      continue;
    }

    if ((frameLength == strlen(kStubReadyMessage)) &&
        (memcmp(frame, kStubReadyMessage, strlen(kStubReadyMessage)) == 0)) {
      return true;
    }
  }

  setStatus(status, "ESP flasher stub did not signal readiness", 0);
  return false;
}

bool Esp32RomFlasher::eraseFlashWithStub(SessionStatus &status) {
  setStatus(status, "Erasing ESP flash with stub loader", 20);
  CommandResponse response;
  if (!sendCommand(kCommandEraseFlash, nullptr, 0U, 0U, response, kEraseTimeoutMs)) {
    setStatus(status, "Stub erase_flash command failed", 0);
    return false;
  }

