DeveloperMarcial/Arduino_Public/src/Esp32RomFlasher.cpp
  return true;
}

bool Esp32RomFlasher::writeImage(const ImageSlot &image, const StagingStore &store, SessionStatus &status, size_t imageIndex, size_t imageCount) {
  const uint32_t writeSize = static_cast<uint32_t>(store.imageSize(image.name));
  if (writeSize == 0U) {
    setStatus(status, "Image staging buffer is empty", 0);
    return false;
  }

  const uint32_t paddedSize = alignedSize(writeSize, kFlashBlockSize);
  const uint32_t blockCount = paddedSize / kFlashBlockSize;
  const uint32_t eraseSize = alignedSize(writeSize, kFlashSectorSize);

  uint8_t beginPayload[20] = {};
  writeLe32(&beginPayload[0], eraseSize);
  writeLe32(&beginPayload[4], blockCount);
  writeLe32(&beginPayload[8], kFlashBlockSize);
  writeLe32(&beginPayload[12], image.offset);
  writeLe32(&beginPayload[16], 0U);  // encrypted_write = false for ESP32-S3 ROM format

  CommandResponse response;
  char detail[96] = {};
  snprintf(detail, sizeof(detail), "Preparing %s at 0x%08lx",
           image.name, static_cast<unsigned long>(image.offset));
  setStatus(status, detail, static_cast<uint8_t>(10U + (imageIndex * 80U) / (imageCount == 0 ? 1U : imageCount)));

  const uint32_t flashBeginTimeout =
      std::max<uint32_t>(kMinimumFlashBeginTimeoutMs,
                         static_cast<uint32_t>(
                             (static_cast<uint64_t>(writeSize) * kEraseRegionTimeoutPerMbMs) / 1000000ULL));
  if (!sendCommand(kCommandFlashBegin, beginPayload, sizeof(beginPayload), 0U, response, flashBeginTimeout)) {
    logCommandResponse("ESP ROM FLASH_BEGIN response:", response);
    setStatus(status, "ESP flash begin failed", 0);
    return false;
  }

  return writeImageBlocks(image, store, status, imageIndex, imageCount);
}

bool Esp32RomFlasher::verifyFlashImage(ImageSlot &image,
                                       const StagingStore &store,
                                       SessionStatus &status,
                                       size_t imageIndex,
                                       size_t imageCount) {
  image.stagedMd5[0] = '\0';
  image.flashMd5[0] = '\0';
  image.flashVerified = false;

  if (!store.calculateImageMd5(image.name, image.stagedMd5, sizeof(image.stagedMd5))) {
    setStatus(status, "Failed to calculate staged image MD5", 0);
    return false;
  }

  const float completedImages = static_cast<float>(imageIndex + 1U);
  const float totalImages = static_cast<float>(imageCount == 0U ? 1U : imageCount);
  char detail[96] = {};
  snprintf(detail, sizeof(detail), "Verifying %s against ESP flash", image.name);
  setStatus(status, detail, static_cast<uint8_t>(20U + (completedImages / totalImages) * 75.0F));

  if (!calculateFlashMd5(image.offset, image.size, image.flashMd5, sizeof(image.flashMd5))) {
    setStatus(status, "ESP flash readback digest failed", 0);
    return false;
  }

  image.flashVerified = strcmp(image.stagedMd5, image.flashMd5) == 0;
  if (!image.flashVerified) {
    setStatus(status, "ESP flash verification mismatch", 0);
    return false;
  }

  snprintf(detail, sizeof(detail), "Verified %s in ESP flash", image.name);
  setStatus(status, detail, static_cast<uint8_t>(25U + (completedImages / totalImages) * 75.0F));
  return true;
}

bool Esp32RomFlasher::writeImageBlocks(const ImageSlot &image, const StagingStore &store, SessionStatus &status, size_t imageIndex, size_t imageCount) {
  uint8_t block[kFlashDataHeaderSize + kFlashBlockSize] = {};
  const uint32_t writeSize = static_cast<uint32_t>(store.imageSize(image.name));
  const uint32_t paddedSize = alignedSize(writeSize, kFlashBlockSize);
  const uint32_t blockCount = paddedSize / kFlashBlockSize;

  for (uint32_t blockIndex = 0; blockIndex < blockCount; ++blockIndex) {
    memset(block, 0xFF, sizeof(block));

    const size_t sourceOffset = static_cast<size_t>(blockIndex) * kFlashBlockSize;
    size_t bytesRead = 0;
    if (sourceOffset < writeSize) {
      const size_t requestLength = std::min<size_t>(kFlashBlockSize, static_cast<size_t>(writeSize) - sourceOffset);
      if (!store.readImageChunk(image.name, sourceOffset, &block[kFlashDataHeaderSize], requestLength, bytesRead) ||
          (bytesRead != requestLength)) {
        setStatus(status, "Failed to read staged image chunk", 0);
        return false;
      }
    }

    writeLe32(&block[0], kFlashBlockSize);
    writeLe32(&block[4], blockIndex);
    writeLe32(&block[8], 0U);
    writeLe32(&block[12], 0U);

    CommandResponse response;
    if (!sendCommand(kCommandFlashData,
                     block,
                     sizeof(block),
                     checksum(&block[kFlashDataHeaderSize], kFlashBlockSize),
                     response,
                     kResponseTimeoutMs)) {
      setStatus(status, "ESP flash data block failed", 0);
      return false;
    }

    const uint32_t effectiveWritten = std::min<uint32_t>((blockIndex + 1U) * kFlashBlockSize, writeSize);
    const float imageFraction = static_cast<float>(effectiveWritten) / static_cast<float>(writeSize == 0U ? 1U : writeSize);
    const float overall = (static_cast<float>(imageIndex) + imageFraction) /
                          static_cast<float>(imageCount == 0U ? 1U : imageCount);

    char detail[96] = {};
    snprintf(detail, sizeof(detail), "Writing %s block %lu/%lu",
             image.name,
             static_cast<unsigned long>(blockIndex + 1U),
             static_cast<unsigned long>(blockCount));
    setStatus(status, detail, static_cast<uint8_t>(15U + overall * 80.0F));
  }

  return true;
}

bool Esp32RomFlasher::sendCommand(uint8_t command,
                                  const uint8_t *payload,
                                  size_t payloadLength,
                                  uint32_t packetChecksum,
                                  CommandResponse &response,
                                  uint32_t timeoutMs) {
  uint8_t header[kCommandHeaderSize] = {};
  header[0] = kPacketRequest;
  header[1] = command;
  writeLe16(&header[2], static_cast<uint16_t>(payloadLength));
  writeLe32(&header[4], packetChecksum);

  AppConfig::espSerial().write(kSlipEnd);
  for (size_t i = 0; i < sizeof(header); ++i) {
    writeSlipEscaped(header[i]);
  }
  for (size_t i = 0; i < payloadLength; ++i) {
    writeSlipEscaped(payload[i]);
  }
  AppConfig::espSerial().write(kSlipEnd);
  AppConfig::espSerial().flush();

  return readResponse(command, response, timeoutMs);
}

bool Esp32RomFlasher::readResponse(uint8_t expectedCommand, CommandResponse &response, uint32_t timeoutMs) {
  return readCommandFrame(expectedCommand, response, timeoutMs, true, 0U);
}

bool Esp32RomFlasher::readCommandFrame(uint8_t expectedCommand,
                                       CommandResponse &response,
                                       uint32_t timeoutMs,
                                       bool expectStatusBytes,
                                       size_t expectedDataLength) {
  const uint32_t deadline = millis() + timeoutMs;

