DeveloperMarcial/Arduino_Public/src/Esp32RomFlasher.cpp
  for (uint8_t attempt = 0; attempt < kCommandResponseRetryCount; ++attempt) {
    const uint32_t now = millis();
    if (now >= deadline) {
      return false;
    }

    uint8_t frame[128] = {};
    size_t frameLength = 0;
    if (!readFrame(frame, sizeof(frame), frameLength, deadline - now)) {
      return false;
    }

    if (frameLength < kCommandHeaderSize) {
      continue;
    }

    response.direction = frame[0];
    response.command = frame[1];
    response.size = readLe16(&frame[2]);
    response.value = readLe32(&frame[4]);

    const size_t availableBody = frameLength - kCommandHeaderSize;
    size_t copiedBody = 0U;
    response.statusLength = 0;
    response.status[0] = 0U;
    response.status[1] = 0U;
    if (expectStatusBytes) {
      if (availableBody < (expectedDataLength + 2U)) {
        continue;
      }
      copiedBody = expectedDataLength;
      response.status[0] = frame[kCommandHeaderSize + expectedDataLength];
      response.status[1] = frame[kCommandHeaderSize + expectedDataLength + 1U];
      response.statusLength = 2U;
    } else {
      copiedBody = availableBody;
    }

    copiedBody = std::min(copiedBody, sizeof(response.data));
    if (copiedBody > 0U) {
      memcpy(response.data, &frame[kCommandHeaderSize], copiedBody);
    }
    response.dataLength = copiedBody;

    const bool statusOk =
        (response.statusLength == 0U) ||
        ((response.status[0] == 0U) && (response.status[1] == 0U));
    if ((response.direction == kPacketResponse) &&
        (response.command == expectedCommand) &&
        statusOk) {
      return true;
    }
  }

  return false;
}

bool Esp32RomFlasher::readFrame(uint8_t *frame, size_t capacity, size_t &frameLength, uint32_t timeoutMs) {
  frameLength = 0;
  bool started = false;
  bool escaped = false;
  const uint32_t deadline = millis() + timeoutMs;

  while (millis() < deadline) {
    while (AppConfig::espSerial().available() > 0) {
      const int value = AppConfig::espSerial().read();
      if (value < 0) {
        break;
      }

      uint8_t byte = static_cast<uint8_t>(value);
      if (!started) {
        if (byte == kSlipEnd) {
          started = true;
          frameLength = 0;
          escaped = false;
        }
        continue;
      }

      if (escaped) {
        if (byte == kSlipEscEnd) {
          byte = kSlipEnd;
        } else if (byte == kSlipEscEsc) {
          byte = kSlipEsc;
        }
        escaped = false;
      } else if (byte == kSlipEsc) {
        escaped = true;
        continue;
      } else if (byte == kSlipEnd) {
        if (frameLength == 0U) {
          continue;
        }
        return true;
      }

      if (frameLength < capacity) {
        frame[frameLength++] = byte;
      }
    }

    delay(1);
  }

  return false;
}

void Esp32RomFlasher::writeSlipEscaped(uint8_t value) {
  if (value == kSlipEnd) {
    AppConfig::espSerial().write(kSlipEsc);
    AppConfig::espSerial().write(kSlipEscEnd);
  } else if (value == kSlipEsc) {
    AppConfig::espSerial().write(kSlipEsc);
    AppConfig::espSerial().write(kSlipEscEsc);
  } else {
    AppConfig::espSerial().write(value);
  }
}

uint8_t Esp32RomFlasher::checksum(const uint8_t *data, size_t length) const {
  uint8_t value = static_cast<uint8_t>(kChecksumMagic);
  for (size_t i = 0; i < length; ++i) {
    value ^= data[i];
  }
  return value;
}

uint32_t Esp32RomFlasher::alignedSize(uint32_t value, uint32_t alignment) const {
  if (alignment == 0U) {
    return value;
  }
  return ((value + alignment - 1U) / alignment) * alignment;
}

bool Esp32RomFlasher::calculateFlashMd5(uint32_t offset, uint32_t length, char *output, size_t outputCapacity) {
  if ((output == nullptr) || (outputCapacity < (kMd5HexLength + 1U))) {
    return false;
  }

  uint8_t payload[16] = {};
  writeLe32(&payload[0], offset);
  writeLe32(&payload[4], length);
  writeLe32(&payload[8], 0U);
  writeLe32(&payload[12], 0U);

  CommandResponse md5Response;
  uint8_t header[kCommandHeaderSize] = {};
  header[0] = kPacketRequest;
  header[1] = kCommandSpiFlashMd5;
  writeLe16(&header[2], sizeof(payload));
  writeLe32(&header[4], 0U);

  AppConfig::espSerial().write(kSlipEnd);
  for (size_t i = 0; i < sizeof(header); ++i) {
    writeSlipEscaped(header[i]);
  }
  for (size_t i = 0; i < sizeof(payload); ++i) {
    writeSlipEscaped(payload[i]);
  }
  AppConfig::espSerial().write(kSlipEnd);
  AppConfig::espSerial().flush();

  if (!readCommandFrame(kCommandSpiFlashMd5, md5Response, md5TimeoutMs(length), true, kMd5HexLength)) {
    logCommandResponse("ESP ROM SPI_FLASH_MD5 response:", md5Response);
    return false;
  }

  if (md5Response.dataLength == kMd5HexLength) {
    memcpy(output, md5Response.data, kMd5HexLength);
    output[kMd5HexLength] = '\0';
    return true;
  }

  if ((md5Response.dataLength == 18U) && (md5Response.data[16] == 0U) && (md5Response.data[17] == 0U)) {
    bytesToHex(md5Response.data, 16U, output, outputCapacity);
    return true;
  }

  logCommandResponse("Unexpected ESP ROM SPI_FLASH_MD5 payload:", md5Response);
  output[0] = '\0';
  return false;
}

uint32_t Esp32RomFlasher::md5TimeoutMs(uint32_t size) const {
  const uint64_t scaled = static_cast<uint64_t>(kMd5TimeoutPerMbMs) * static_cast<uint64_t>(size);
  const uint32_t timeout = static_cast<uint32_t>(scaled / 1000000ULL);
  return std::max(kMinimumMd5TimeoutMs, timeout);
}

void Esp32RomFlasher::setStatus(SessionStatus &status, const char *detail, uint8_t progress) {
  strlcpy(status.detail, detail, sizeof(status.detail));
  status.progress = progress;
}
